<?php


// Функция  вычисляющая   произведение частных сумм дробей 
//Дана  такая  функция:
//f(i) = 1/(i^2 + 1)  +  1/(i^2 + 2)  + ...  + 1/( i^2 + ( j + 1) ) , i = 0 , 1 , 2 .....n; j= 0,1,2 ... i; 
//Написать программу  вычисления произведения f(0) * f(1) * f(2)* ......
//здесь f(0), f(1), f(2) -частные суммы общей  функций
//Например, f(0) = 1/(0^2 +1) =1/(0+1)=1/1=1; 
//f(1) = 1/(1^2+2) + 1/(1^2 + 2) =1/(1+1) + 1/(1+2) =1/2 + 1/3 = 5/6;
//f(2) = 1/(2^2 + 1) + 1/(2^2 + 2) + 1/(2^2 + 3) = 1/5 + 1/6 +1/7 =107/210;


$n = 2;
function productOfPartialSumsOfFractions($n){
    $f = 0;
    $p = 1;
   
    for ($i = 0; $i <= $n; $i++) {
        for ($j = 0; $j <= $i; $j++) {
            $f += 1 / (pow($i, 2) + $j + 1);
    
        }
    
        $p *= $f;
    
        $f = 0;
    }
    return $p;
}


print_r(productOfPartialSumsOfFractions($n));
